<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"653bb890ce15ad84f9629f0c9ab2672034d550281376ef48772853057b6734e2","plan_job_ref":"Job terraform plan #137 at https://github.com/suzutan/infra/actions/runs/17026322672","plan_out_hash":"502a308ffaa02d0c5a66dd5b56819a15941cbf07468748c700639906295ba74a","plan_hash":"89801790f8949e45e872ea56d935a6ae8b8ed6cf1dd36f0fcacd39591decc58f","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __terraform/suzutan.jp__
<details>
<summary>Plan: 0 to add, 6 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.atria will be updated in-place
!~  resource "cloudflare_dns_record" "atria" {
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-08-02T04:41:11Z" -> (known after apply)
        id                  = "59a09e378f50d3af7ff95cc3e868d488"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-08-03T16:24:50Z" -> (known after apply)
!~      name                = "atria.suzutan.jp" -> "atria"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.bluesky_site_verification will be updated in-place
!~  resource "cloudflare_dns_record" "bluesky_site_verification" {
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
        id                  = "e895419ec0a8ee15e34fbc09adf0e58f"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "_atproto.suzutan.jp" -> "_atproto"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "osk_nw" {
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-08-02T04:41:11Z" -> (known after apply)
        id                  = "ef444d7a067687ae05001a565990a99f"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-08-02T04:41:11Z" -> (known after apply)
!~      name                = "osk.nw.suzutan.jp" -> "osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.rt_osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "rt_osk_nw" {
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-08-02T04:41:11Z" -> (known after apply)
        id                  = "8cacbbb03bd85d344fd1409dc5c3d3ab"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-08-02T04:41:11Z" -> (known after apply)
!~      name                = "rt.osk.nw.suzutan.jp" -> "rt.osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.silverstone_osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "silverstone_osk_nw" {
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-08-02T04:41:11Z" -> (known after apply)
        id                  = "52bec1326328e722883c3d48e44d926f"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-08-02T04:41:11Z" -> (known after apply)
!~      name                = "silverstone.osk.nw.suzutan.jp" -> "silverstone.osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.spica will be updated in-place
!~  resource "cloudflare_dns_record" "spica" {
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-08-02T04:41:11Z" -> (known after apply)
        id                  = "6034bcf075d846cd326a8e54b092db04"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-08-03T16:24:50Z" -> (known after apply)
!~      name                = "spica.suzutan.jp" -> "spica"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #137](https://github.com/suzutan/infra/actions/runs/17026322672)